#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Personal-McSwain/nws-slack-bot/runs/run-DobsVqgjffDX5SH9

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.site-zone: Refreshing...
data.cloudflare_zone.site-zone: Refresh complete after 0s [id=53edb099eda8452d04fc375e5ddef445]
data.aws_iam_policy_document.ecs-agent: Refreshing...
data.aws_availability_zones.available_zones: Refreshing...
aws_route53_zone.site: Refreshing state... [id=Z0342225IDS20GT3MJC6]
aws_kms_key.s3-encryption: Refreshing state... [id=75a0423b-34a8-4682-8dcb-8b91a1fcfd34]
aws_acm_certificate.site: Refreshing state... [id=arn:aws:acm:us-east-1:803205869942:certificate/5d33d9c9-7e7c-467b-9fcf-daf31aefa54a]
aws_kms_key.log-encryption: Refreshing state... [id=7ac33160-f5f4-4aff-8830-52338bb14121]
data.aws_iam_policy_document.ecs-agent: Refresh complete after 0s [id=1991238092]
data.aws_ami.ecs: Refreshing...
aws_apigatewayv2_api.apigw: Refreshing state... [id=5cvzn33d8f]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0869a1373d101fce3]
aws_kms_key.installations-encryption: Refreshing state... [id=446f1d53-e742-4bc3-b044-c8bc20659d19]
aws_s3_bucket.data: Refreshing state... [id=nws-slack-bot-data]
aws_dynamodb_table.alerts: Refreshing state... [id=nws-slack-bot-alerts]
aws_cloudwatch_log_group.logs: Refreshing state... [id=nws-slack-bot]
aws_iam_role.ecs-agent: Refreshing state... [id=nws-slack-bot-ecs-agent]
data.aws_availability_zones.available_zones: Refresh complete after 0s [id=us-east-1]
aws_dynamodb_table.installations: Refreshing state... [id=nws-slack-bot-installations]
data.aws_iam_policy_document.allow-kms: Refreshing...
data.aws_iam_policy_document.allow-kms: Refresh complete after 0s [id=3630732129]
data.aws_iam_policy_document.allow-cloudwatch-logs: Refreshing...
data.aws_iam_policy_document.allow-cloudwatch-logs: Refresh complete after 0s [id=3068348559]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:803205869942:cluster/nws-slack-bot]
aws_iam_policy.kms: Refreshing state... [id=arn:aws:iam::803205869942:policy/nws-slack-bot-kms]
aws_apigatewayv2_stage.stage: Refreshing state... [id=$default]
data.aws_iam_policy_document.allow-dynamodb: Refreshing...
data.aws_iam_policy_document.allow-dynamodb: Refresh complete after 0s [id=959118782]
aws_iam_policy.dynamodb: Refreshing state... [id=arn:aws:iam::803205869942:policy/nws-slack-bot-dynamodb]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=nws-slack-bot-ecs-agent-20230620175236410300000001]
aws_iam_instance_profile.ecs-agent: Refreshing state... [id=nws-slack-bot-ecs-agent]
aws_iam_role_policy_attachment.ecs-agent: Refreshing state... [id=nws-slack-bot-ecs-agent-20230620175236410300000002]
aws_ecs_task_definition.nws-bot: Refreshing state... [id=nws-slack-bot]
data.aws_ami.ecs: Refresh complete after 0s [id=ami-0507dff4275d8dd6d]
aws_iam_role_policy_attachment.kms: Refreshing state... [id=nws-slack-bot-ecs-agent-20230621171536643700000001]
aws_iam_role_policy_attachment.dynamodb: Refreshing state... [id=nws-slack-bot-ecs-agent-20230621084833472100000001]
data.aws_iam_policy_document.allow-s3: Refreshing...
data.aws_iam_policy_document.allow-s3: Refresh complete after 0s [id=1254761829]
aws_s3_bucket_server_side_encryption_configuration.encryption: Refreshing state... [id=nws-slack-bot-data]
aws_iam_policy.s3: Refreshing state... [id=arn:aws:iam::803205869942:policy/nws-slack-bot-s3]
aws_route53_record.caa: Refreshing state... [id=Z0342225IDS20GT3MJC6_nws-slack-bot.mcswain.dev_CAA]
aws_route53_record.validation["nws-slack-bot.mcswain.dev"]: Refreshing state... [id=Z0342225IDS20GT3MJC6__ab3ec2d32e3794d519230bacd3852088.nws-slack-bot.mcswain.dev._CNAME]
cloudflare_record.ns3: Refreshing state... [id=d7654127a0de328d888f3908ecd60e9d]
cloudflare_record.ns: Refreshing state... [id=5fa55a415ee829adcd638eb8d200667c]
cloudflare_record.ns2: Refreshing state... [id=5f4183518f57b6d723e866777db08b11]
cloudflare_record.ns1: Refreshing state... [id=74536ff7310298f73df8263cae3e5895]
aws_iam_role_policy_attachment.s3: Refreshing state... [id=nws-slack-bot-ecs-agent-20230622015906054600000001]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06b33771efe6f32e8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-024d327702a63e149]
aws_security_group.vpc-link: Refreshing state... [id=sg-0b96b12b2e92d79e9]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0003b410b5b0e7990]
aws_service_discovery_private_dns_namespace.pdns: Refreshing state... [id=ns-42n4ky46ijgyu2eb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c8be730deb8bcc8e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f0524382358dd157]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-088aa198b76199207]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d7e42a1f0e1e6b28]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f32cd6f8f33d9b4b]
aws_service_discovery_service.service-discovery: Refreshing state... [id=srv-aqvrygpggwmylsog]
aws_security_group.deny-all-inbound: Refreshing state... [id=sg-08a84bdf05574d0c5]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0adbb18473dfc90a1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-098281f0eff9cf6bc]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09597faeeb1e03f77]
aws_apigatewayv2_vpc_link.vpc-link: Refreshing state... [id=g961s1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c8be730deb8bcc8e1080289494]
aws_acm_certificate_validation.validation: Refreshing state... [id=2023-06-21 20:41:57.155 +0000 UTC]
aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-1:803205869942:service/nws-slack-bot/nws-slack-bot]
aws_launch_template.ecs: Refreshing state... [id=lt-01edfc91ef7598f17]
aws_apigatewayv2_integration.integration: Refreshing state... [id=et21u0m]
aws_autoscaling_group.asg: Refreshing state... [id=terraform-20230621035128220900000001]
aws_apigatewayv2_domain_name.api-domain: Refreshing state... [id=nws-slack-bot.mcswain.dev]
aws_apigatewayv2_route.apigw-route: Refreshing state... [id=97d4ly3]
aws_apigatewayv2_api_mapping.mapping: Refreshing state... [id=0szhsf]
aws_route53_record.app: Refreshing state... [id=Z0342225IDS20GT3MJC6_nws-slack-bot.mcswain.dev_A]
aws_ecs_task_definition.nws-bot: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:803205869942:service/nws-slack-bot/nws-slack-bot"
        name                               = "nws-slack-bot"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:803205869942:task-definition/nws-slack-bot:54" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.nws-bot must be replaced
-/+ resource "aws_ecs_task_definition" "nws-bot" {
      ~ arn                      = "arn:aws:ecs:us-east-1:803205869942:task-definition/nws-slack-bot:54" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:803205869942:task-definition/nws-slack-bot" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "nws-slack-bot" -> (known after apply)
      ~ revision                 = 54 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```

</details>
*Pushed by: @renovate[bot], Action: `pull_request`*